docs/C_CPP_Manual.org
* Build Develop Environment
** Install Common Used Libs
*** boost
- Ubuntu
sudo apt-get install libboost-all-dev

* Memory Analysis
** Data Area
*** static area
This shows the typical layout of a simple computer's program memory with the text, various data, and stack and heap sections.
The .data segment contains any global or static variables which have a pre-defined value and can be modified. That is any variables that are not defined within a function (and thus can be accessed from anywhere) or are defined in a function but are defined as static so they retain their address across subsequent calls. Examples, in C, include:
#+BEGIN_SRC C
   int val = 3;
   char string[] = "Hello World";
#+END_SRC
The values for these variables are initially stored within the read-only memory (typically within .text) and are copied into the .data segment during the start-up routine of the program.

*** Stack
- Stack overflow
#+BEGIN_SRC C
  #include <stdio.h>
  void main()
  {
    int a[1024*3000];
    printf("%d ",a[0]);
  }
#+END_SRC
The default static size is 1M in VisualStudio
#+RESULTS:
- Stack can cause higher CPU  utilization
#+BEGIN_SRC C
  #include<stdio.h>
  void main()
  {
    while(1)
      {
        double db[1024*200];
      }
  }
#+END_SRC
*** Heap
malloc/free

** BSS [Uninitialized data segment]
The BSS segment, also known as uninitialized data, is usually adjacent to the data segment. The BSS segment contains all global variables and static variables that are initialized to zero or do not have explicit initialization in source code. For instance, a variable defined as *static int i;* would be contained in the BSS segment.
** Text
The code segment, also known as a text segment or simply as text, is where a portion of an object file or the corresponding section of the program's virtual address space that contains executable instructions is stored and is generally read-only and fixed size.
** References
[1] Memory Layout of C Programs: http://www.geeksforgeeks.org/memory-layout-of-c-program/

* Grammer
** Register Variable
- Does Register variable have address?
Q: Is this correct?
#+BEGIN_SRC C
     register int c=3;
     int* pb=&c;
#+END_SRC
A: wrong

** definition vs declaration 
A declaration introduces an identifier and describes its type, be it a type, object, or function. A declaration is what the compiler needs to accept references to that identifier. These are declarations:
#+BEGIN_SRC C
extern int bar;
extern int g(int, int);
double f(int, double); // extern can be omitted for function declarations
class foo; // no extern allowed for type declarations
#+END_SRC
A definition actually instantiates/implements this identifier. It's what the linker needs in order to link references to those entities. These are definitions corresponding to the above declarations:
#+BEGIN_SRC C
int bar;
int g(int lhs, int rhs) {return lhs*rhs;}
double f(int i, double d) {return i+d;}
class foo {};
#+END_SRC
A definition can be used in the place of a declaration.

An identifier can be declared as often as you want. Thus, the following is legal in C and C++:
#+BEGIN_SRC C
double f(int, double);
double f(int, double);
extern double f(int, double); // the same as the two above
extern double f(int, double);
#+END_SRC
However, it must be defined exactly once. If you forget to define something that's been declared and referenced somewhere, then the linker doesn't know what to link references to and complains about a missing symbols. If you define something more than once, then the linker doesn't know which of the definitions to link references to and complains about duplicated symbols.

** static
#+BEGIN_SRC C
#include <stdio.h>
#include <stdlib.h>
static int static_num = 30; //limited access privilage to only this file
int main()
{
	//static
	for (int i = 0; i < 10; i++)
	{
		int a = 10;
		static int b = 11; //static local variable, initialized when compile, initialize once
		a += 1;
		b += 1;
		printf("%d, %d\n", a, b);
	}

	for (int i = 0; i <= 100; i++)
	{
		static int res = 0;
		res += i;
		if(i==100)
		{
			printf("%d\n", res);
		}
	}
  return 0;
}
#+END_SRC

#+RESULTS:
| 11,  | 12 |
| 11,  | 13 |
| 11,  | 14 |
| 11,  | 15 |
| 11,  | 16 |
| 11,  | 17 |
| 11,  | 18 |
| 11,  | 19 |
| 11,  | 20 |
| 11,  | 21 |
| 5050 |    |

** DataType  
*** DataType Convertion
