docs/C_CPP_Manual.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-11-29 Wed 08:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yubao" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org279cdc2">1. Build Develop Environment</a>
<ul>
<li><a href="#org5b1227c">1.1. Install Common Used Libs</a>
<ul>
<li><a href="#org19e40d2">1.1.1. boost</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc79f7d6">2. Memory Analysis</a>
<ul>
<li><a href="#orge34e881">2.1. Memory Layout of C Programs</a></li>
</ul>
</li>
<li><a href="#orgea3586f">3. Grammer</a>
<ul>
<li><a href="#orgc5ee6c8">3.1. definition vs declaration</a></li>
<li><a href="#org4b13ca8">3.2. DataType</a>
<ul>
<li><a href="#org444dc18">3.2.1. DataType Convertion</a></li>
<li><a href="#orgdaf4223">3.2.2. string to other datatypes</a></li>
<li><a href="#org4e739c6">3.2.3. convert int to string</a></li>
<li><a href="#org2aa6b2c">3.2.4. Array or subset</a></li>
<li><a href="#org162d2e2">3.2.5. "sizeof" test</a></li>
<li><a href="#orgd9eac3f">3.2.6. How to get the length of an array</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc231851">4. Libs</a>
<ul>
<li><a href="#orgeb9937e">4.1. boost</a></li>
<li><a href="#org72392b0">4.2. Lexical Cast</a></li>
<li><a href="#orgfd76560">4.3. variant</a></li>
<li><a href="#org1858c13">4.4. Any</a></li>
<li><a href="#orgaf890ec">4.5. optional</a></li>
</ul>
</li>
<li><a href="#org73980b5">5. Code optimization</a>
<ul>
<li><a href="#orga8d642c">5.1. Does Register variable have address?</a></li>
<li><a href="#org0b77388">5.2. Stack overflow</a></li>
<li><a href="#orgec73d58">5.3. Stack can cause higher CPU  utilization</a></li>
</ul>
</li>
<li><a href="#org9005c17">6. reference</a></li>
</ul>
</div>
</div>
<div id="outline-container-org279cdc2" class="outline-2">
<h2 id="org279cdc2"><span class="section-number-2">1</span> Build Develop Environment</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org5b1227c" class="outline-3">
<h3 id="org5b1227c"><span class="section-number-3">1.1</span> Install Common Used Libs</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org19e40d2" class="outline-4">
<h4 id="org19e40d2"><span class="section-number-4">1.1.1</span> boost</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>Ubuntu</li>
</ul>
<p>
sudo apt-get install libboost-all-dev
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc79f7d6" class="outline-2">
<h2 id="orgc79f7d6"><span class="section-number-2">2</span> Memory Analysis</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orge34e881" class="outline-3">
<h3 id="orge34e881"><span class="section-number-3">2.1</span> Memory Layout of C Programs</h3>
<div class="outline-text-3" id="text-2-1">
<p>
reference: <a href="http://www.geeksforgeeks.org/memory-layout-of-c-program/">http://www.geeksforgeeks.org/memory-layout-of-c-program/</a>
</p>

<ul class="org-ul">
<li>Stack</li>
</ul>
<p>
size default: 1M
</p>

<ul class="org-ul">
<li>Heap</li>
</ul>
<p>
malloc/free
</p>

<ul class="org-ul">
<li>BSS [Uninitialized data segment]</li>
</ul>
<p>
The BSS segment, also known as uninitialized data, is usually adjacent to the data segment. The BSS segment contains all global variables and static variables that are initialized to zero or do not have explicit initialization in source code. For instance, a variable defined as <b>static int i;</b> would be contained in the BSS segment.
</p>

<ul class="org-ul">
<li>Data [nitialized data segment]</li>
</ul>
<p>
This shows the typical layout of a simple computer's program memory with the text, various data, and stack and heap sections.
The .data segment contains any global or static variables which have a pre-defined value and can be modified. That is any variables that are not defined within a function (and thus can be accessed from anywhere) or are defined in a function but are defined as static so they retain their address across subsequent calls. Examples, in C, include:
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">val</span> = <span style="color: #a45bad;">3</span>;
<span style="color: #ce537a; font-weight: bold;">char</span> <span style="color: #7590db;">string</span><span style="color: #4f97d7;">[]</span> = <span style="color: #2d9574;">"Hello World"</span>;
</pre>
</div>
<p>
The values for these variables are initially stored within the read-only memory (typically within .text) and are copied into the .data segment during the start-up routine of the program.
</p>

<ul class="org-ul">
<li>Text</li>
</ul>
<p>
The code segment, also known as a text segment or simply as text, is where a portion of an object file or the corresponding section of the program's virtual address space that contains executable instructions is stored and is generally read-only and fixed size.
</p>
</div>
</div>
</div>

<div id="outline-container-orgea3586f" class="outline-2">
<h2 id="orgea3586f"><span class="section-number-2">3</span> Grammer</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgc5ee6c8" class="outline-3">
<h3 id="orgc5ee6c8"><span class="section-number-3">3.1</span> definition vs declaration</h3>
<div class="outline-text-3" id="text-3-1">
<p>
A declaration introduces an identifier and describes its type, be it a type, object, or function. A declaration is what the compiler needs to accept references to that identifier. These are declarations:
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #4f97d7; font-weight: bold;">extern</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">bar</span>;
<span style="color: #4f97d7; font-weight: bold;">extern</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">g</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">int</span>, <span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #4f97d7;">)</span>;
<span style="color: #ce537a; font-weight: bold;">double</span> <span style="color: #bc6ec5; font-weight: bold;">f</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">int</span>, <span style="color: #ce537a; font-weight: bold;">double</span><span style="color: #4f97d7;">)</span>; <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">extern can be omitted for function declarations</span>
<span style="color: #ce537a; font-weight: bold;">class</span> <span style="color: #7590db;">foo</span>; <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">no extern allowed for type declarations</span>
</pre>
</div>
<p>
A definition actually instantiates/implements this identifier. It's what the linker needs in order to link references to those entities. These are definitions corresponding to the above declarations:
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">bar</span>;
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">g</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">lhs</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">rhs</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span><span style="color: #4f97d7; font-weight: bold;">return</span> lhs*rhs;<span style="color: #4f97d7;">}</span>
<span style="color: #ce537a; font-weight: bold;">double</span> <span style="color: #bc6ec5; font-weight: bold;">f</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span>, <span style="color: #ce537a; font-weight: bold;">double</span> <span style="color: #7590db;">d</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span><span style="color: #4f97d7; font-weight: bold;">return</span> i+d;<span style="color: #4f97d7;">}</span>
<span style="color: #ce537a; font-weight: bold;">class</span> <span style="color: #7590db;">foo</span> <span style="color: #4f97d7;">{}</span>;
</pre>
</div>
<p>
A definition can be used in the place of a declaration.
</p>

<p>
An identifier can be declared as often as you want. Thus, the following is legal in C and C++:
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">double</span> <span style="color: #bc6ec5; font-weight: bold;">f</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">int</span>, <span style="color: #ce537a; font-weight: bold;">double</span><span style="color: #4f97d7;">)</span>;
<span style="color: #ce537a; font-weight: bold;">double</span> <span style="color: #bc6ec5; font-weight: bold;">f</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">int</span>, <span style="color: #ce537a; font-weight: bold;">double</span><span style="color: #4f97d7;">)</span>;
<span style="color: #4f97d7; font-weight: bold;">extern</span> <span style="color: #ce537a; font-weight: bold;">double</span> <span style="color: #bc6ec5; font-weight: bold;">f</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">int</span>, <span style="color: #ce537a; font-weight: bold;">double</span><span style="color: #4f97d7;">)</span>; <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">the same as the two above</span>
<span style="color: #4f97d7; font-weight: bold;">extern</span> <span style="color: #ce537a; font-weight: bold;">double</span> <span style="color: #bc6ec5; font-weight: bold;">f</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">int</span>, <span style="color: #ce537a; font-weight: bold;">double</span><span style="color: #4f97d7;">)</span>;
</pre>
</div>
<p>
However, it must be defined exactly once. If you forget to define something that's been declared and referenced somewhere, then the linker doesn't know what to link references to and complains about a missing symbols. If you define something more than once, then the linker doesn't know which of the definitions to link references to and complains about duplicated symbols.
</p>
</div>
</div>

<div id="outline-container-org4b13ca8" class="outline-3">
<h3 id="org4b13ca8"><span class="section-number-3">3.2</span> DataType</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org444dc18" class="outline-4">
<h4 id="org444dc18"><span class="section-number-4">3.2.1</span> DataType Convertion</h4>
</div>
