docs/C_CPP_Manual.org
*** string to other datatypes
- atof : convert string to double
- atoi : convert string to integer
- atoll : convert string to long integger
- strtof : convert string to double
- strtof : convert string to float
- strtoll : convert sting to long integer
- strtoul : convert string to unsigned long integer
- strtoull : convert string to unsigned long long integer    
*** convert int to string
#+BEGIN_SRC C++ :exports both
#include <string>
#include <sstream>  
#include <iostream>
using namespace std;
int main(int argc, char *argv[])
{
  int int_val=100;
  stringstream strm;
  strm<<int_val;
  string s=strm.str();
  cout<<s<<endl;
  return 0;
}
#+END_SRC

#+RESULTS:
: 100
*** Array or subset
*** "sizeof" test
#+BEGIN_SRC C
#include <stdio.h>
int main()
{
  int intValue=5;
  int *pInt=&intValue;
  printf("sizeof int pointer: %d\n",sizeof(pInt));

  int int_array[6]={0};
  printf("sizeof int array with initialization:%d \n",sizeof(int_array));

  char charValue='A';
  char* pChar=&charValue;
  printf("sizeof char pointer: %d \n",sizeof(pChar));

  char char_arr[10]={'\0'};
  printf("sizeof char array: %d \n", sizeof(char_arr));
}
#+END_SRC

*** How to get the length of an array
#+BEGIN_SRC C :tangle get_array_length.cpp 
#include <stdio.h>
using namespace std;

int main ()
{
  int arr[]={6,1,3,5,6,8,8,10};

  int len=sizeof(arr)/sizeof(arr[0]);

  printf("array size: %d", len);

}
#+END_SRC
** Parameters in function
#+BEGIN_SRC C
  #include<stdio.h>
  #include<stdlib.h>
  int main()
  {
    //parameter sequence
    int p = 5;
    printf("%d, %d", p, ++p);
    return 0;
  }
#+END_SRC

#+RESULTS:
| 6 | 6 |

The seqence that puts parameters to stack is from right to left
** Function Pointer
Function Pointer is pointers to functions. Following is an example:
#+BEGIN_SRC C
  #include<stdio.h>
  void func(int a)
  {
    printf("Value in func is %d \n",a);
  }
  int main()
  {
    void (*func_ptr)(int)=func;
    func(10);
    func_ptr(100);
  }
#+END_SRC

#+RESULTS:
| Value | in | func | is |  10 |
| Value | in | func | is | 100 |

* 3dParty Libs
** boost
