docs/C_CPP_Manual.html
<div id="outline-container-orgdaf4223" class="outline-4">
<h4 id="orgdaf4223"><span class="section-number-4">3.2.2</span> string to other datatypes</h4>
<div class="outline-text-4" id="text-3-2-2">
<ul class="org-ul">
<li>atof : convert string to double</li>
<li>atoi : convert string to integer</li>
<li>atoll : convert string to long integger</li>
<li>strtof : convert string to double</li>
<li>strtof : convert string to float</li>
<li>strtoll : convert sting to long integer</li>
<li>strtoul : convert string to unsigned long integer</li>
<li>strtoull : convert string to unsigned long long integer</li>
</ul>
</div>
</div>
<div id="outline-container-org4e739c6" class="outline-4">
<h4 id="org4e739c6"><span class="section-number-4">3.2.3</span> convert int to string</h4>
<div class="outline-text-4" id="text-3-2-3">
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">string</span><span style="color: #4f97d7;">&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">sstream</span><span style="color: #4f97d7;">&gt;</span>  
<span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">iostream</span><span style="color: #4f97d7;">&gt;</span>
<span style="color: #4f97d7; font-weight: bold;">using</span> <span style="color: #4f97d7; font-weight: bold;">namespace</span> <span style="color: #a45bad;">std</span>;
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span><span style="color: #bc6ec5;">[]</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">{</span>
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">int_val</span>=<span style="color: #a45bad;">100</span>;
  <span style="color: #ce537a; font-weight: bold;">stringstream</span> <span style="color: #7590db;">strm</span>;
  strm&lt;&lt;int_val;
  <span style="color: #ce537a; font-weight: bold;">string</span> <span style="color: #7590db;">s</span>=strm.str<span style="color: #bc6ec5;">()</span>;
  cout&lt;&lt;s&lt;&lt;endl;
  <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<pre class="example">
100

</pre>
</div>
</div>
<div id="outline-container-org2aa6b2c" class="outline-4">
<h4 id="org2aa6b2c"><span class="section-number-4">3.2.4</span> Array or subset</h4>
</div>
<div id="outline-container-org162d2e2" class="outline-4">
<h4 id="org162d2e2"><span class="section-number-4">3.2.5</span> "sizeof" test</h4>
<div class="outline-text-4" id="text-3-2-5">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdio.h</span><span style="color: #4f97d7;">&gt;</span>
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7;">{</span>
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">intValue</span>=<span style="color: #a45bad;">5</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">pInt</span>=&amp;intValue;
  printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"sizeof int pointer: %d\n"</span>,<span style="color: #4f97d7; font-weight: bold;">sizeof</span><span style="color: #2d9574;">(</span>pInt<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>;

  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">int_array</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">6</span><span style="color: #bc6ec5;">]</span>=<span style="color: #bc6ec5;">{</span><span style="color: #a45bad;">0</span><span style="color: #bc6ec5;">}</span>;
  printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"sizeof int array with initialization:%d \n"</span>,<span style="color: #4f97d7; font-weight: bold;">sizeof</span><span style="color: #2d9574;">(</span>int_array<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>;

  <span style="color: #ce537a; font-weight: bold;">char</span> <span style="color: #7590db;">charValue</span>=<span style="color: #2d9574;">'A'</span>;
  <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">pChar</span>=&amp;charValue;
  printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"sizeof char pointer: %d \n"</span>,<span style="color: #4f97d7; font-weight: bold;">sizeof</span><span style="color: #2d9574;">(</span>pChar<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>;

  <span style="color: #ce537a; font-weight: bold;">char</span> <span style="color: #7590db;">char_arr</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">10</span><span style="color: #bc6ec5;">]</span>=<span style="color: #bc6ec5;">{</span><span style="color: #2d9574;">'\0'</span><span style="color: #bc6ec5;">}</span>;
  printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"sizeof char array: %d \n"</span>, <span style="color: #4f97d7; font-weight: bold;">sizeof</span><span style="color: #2d9574;">(</span>char_arr<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd9eac3f" class="outline-4">
<h4 id="orgd9eac3f"><span class="section-number-4">3.2.6</span> How to get the length of an array</h4>
<div class="outline-text-4" id="text-3-2-6">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdio.h</span><span style="color: #4f97d7;">&gt;</span>
using <span style="color: #ce537a; font-weight: bold;">namespace</span> <span style="color: #7590db;">std</span>;

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span> <span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7;">{</span>
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">arr</span><span style="color: #bc6ec5;">[]</span>=<span style="color: #bc6ec5;">{</span><span style="color: #a45bad;">6</span>,<span style="color: #a45bad;">1</span>,<span style="color: #a45bad;">3</span>,<span style="color: #a45bad;">5</span>,<span style="color: #a45bad;">6</span>,<span style="color: #a45bad;">8</span>,<span style="color: #a45bad;">8</span>,<span style="color: #a45bad;">10</span><span style="color: #bc6ec5;">}</span>;

  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">len</span>=<span style="color: #4f97d7; font-weight: bold;">sizeof</span><span style="color: #bc6ec5;">(</span>arr<span style="color: #bc6ec5;">)</span>/<span style="color: #4f97d7; font-weight: bold;">sizeof</span><span style="color: #bc6ec5;">(</span>arr<span style="color: #2d9574;">[</span><span style="color: #a45bad;">0</span><span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">)</span>;

  printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"array size: %d"</span>, len<span style="color: #bc6ec5;">)</span>;

<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>
</div>
