docs/C_CPP_Manual.org
** Lexical Cast
 Use "boost" lib to Convert DataType
#+BEGIN_SRC C++ :exports_both
  #include <string>
  #include <iostream>
  #include "boost/lexical_cast.hpp"
  using boost::lexical_cast;
  using boost::bad_lexical_cast;
  using namespace std;
  int main(int argc, char *argv[])
  {
    int s=23;
    string str=lexical_cast<string>(s);
    cout<<"int to str: "<<str<<endl;

    str="Message: "+lexical_cast<string>('A')+"="+lexical_cast<string>(34.5);
    cout<<"char and float to str: "<<str<<endl;

    array<char,64> msg=lexical_cast<array<char,64>>(23);
    for (int i=0; i <2 ; i++) {
      cout<<"int to char array, msg:"<<msg[i]<<endl;  
    }


    s=lexical_cast<int>("3456");
    cout<<"int to string:"<<s<<endl;

    try {
      s=lexical_cast<int>("56.78");  // bad_lexical_cast
    } catch (bad_lexical_cast &e) {
      cout<<"Exception caught: "<<e.what()<<endl;
    }
    try{
    s=lexical_cast<int>("3456yu");//bad_lexical_cast
    }catch(bad_lexical_cast &e){
      cout<<"Exception caught: "<<e.what()<<endl;
    }
    s=lexical_cast<int>("3456yu",4);
    cout<<s<<endl;
    return 0;
  } 

#+END_SRC

#+RESULTS:
| int       | to      | str:        | 23      |       |          |        |       |       |     |    |             |    |        |
| char      | and     | float       | to      | str:  | Message: | A=34.5 |       |       |     |    |             |    |        |
| int       | to      | char        | array,  | msg:2 |          |        |       |       |     |    |             |    |        |
| int       | to      | char        | array,  | msg:3 |          |        |       |       |     |    |             |    |        |
| int       | to      | string:3456 |         |       |          |        |       |       |     |    |             |    |        |
| Exception | caught: | bad         | lexical | cast: | source   | type   | value | could | not | be | interpreted | as | target |
| Exception | caught: | bad         | lexical | cast: | source   | type   | value | could | not | be | interpreted | as | target |
| 3456      |         |             |         |       |          |        |       |       |     |    |             |    |        |

