docs/C_CPP_Manual.html
<div id="outline-container-orgc231851" class="outline-2">
<h2 id="orgc231851"><span class="section-number-2">4</span> Libs</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgeb9937e" class="outline-3">
<h3 id="orgeb9937e"><span class="section-number-3">4.1</span> boost</h3>
</div>
<div id="outline-container-org72392b0" class="outline-3">
<h3 id="org72392b0"><span class="section-number-3">4.2</span> Lexical Cast</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Use "boost" lib to Convert DataType
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">string</span><span style="color: #4f97d7;">&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">iostream</span><span style="color: #4f97d7;">&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">"boost/lexical_cast.hpp"</span>
<span style="color: #4f97d7; font-weight: bold;">using</span> <span style="color: #a45bad;">boost</span>::<span style="color: #ce537a; font-weight: bold;">lexical_cast</span>;
<span style="color: #4f97d7; font-weight: bold;">using</span> <span style="color: #a45bad;">boost</span>::<span style="color: #ce537a; font-weight: bold;">bad_lexical_cast</span>;
<span style="color: #4f97d7; font-weight: bold;">using</span> <span style="color: #4f97d7; font-weight: bold;">namespace</span> <span style="color: #a45bad;">std</span>;
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span><span style="color: #bc6ec5;">[]</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">{</span>
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">s</span>=<span style="color: #a45bad;">23</span>;
  <span style="color: #ce537a; font-weight: bold;">string</span> <span style="color: #7590db;">str</span>=lexical_cast<span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">string</span><span style="color: #bc6ec5;">&gt;(</span>s<span style="color: #bc6ec5;">)</span>;
  cout&lt;&lt;<span style="color: #2d9574;">"int to str: "</span>&lt;&lt;str&lt;&lt;endl;

  str=<span style="color: #2d9574;">"Message: "</span>+lexical_cast<span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">string</span><span style="color: #bc6ec5;">&gt;(</span><span style="color: #2d9574;">'A'</span><span style="color: #bc6ec5;">)</span>+<span style="color: #2d9574;">"="</span>+lexical_cast<span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">string</span><span style="color: #bc6ec5;">&gt;(</span><span style="color: #a45bad;">34.5</span><span style="color: #bc6ec5;">)</span>;
  cout&lt;&lt;<span style="color: #2d9574;">"char and float to str: "</span>&lt;&lt;str&lt;&lt;endl;

  <span style="color: #ce537a; font-weight: bold;">array</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">char</span>,<span style="color: #a45bad;">64</span><span style="color: #bc6ec5;">&gt;</span> <span style="color: #7590db;">msg</span>=lexical_cast<span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">array</span><span style="color: #2d9574;">&lt;</span><span style="color: #ce537a; font-weight: bold;">char</span>,<span style="color: #a45bad;">64</span><span style="color: #2d9574;">&gt;</span><span style="color: #bc6ec5;">&gt;(</span><span style="color: #a45bad;">23</span><span style="color: #bc6ec5;">)</span>;
  <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span>=<span style="color: #a45bad;">0</span>; i &lt;<span style="color: #a45bad;">2</span> ; i++<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    cout&lt;&lt;<span style="color: #2d9574;">"int to char array, msg:"</span>&lt;&lt;msg<span style="color: #2d9574;">[</span>i<span style="color: #2d9574;">]</span>&lt;&lt;endl;  
  <span style="color: #bc6ec5;">}</span>


  s=lexical_cast<span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #bc6ec5;">&gt;(</span><span style="color: #2d9574;">"3456"</span><span style="color: #bc6ec5;">)</span>;
  cout&lt;&lt;<span style="color: #2d9574;">"int to string:"</span>&lt;&lt;s&lt;&lt;endl;

  <span style="color: #4f97d7; font-weight: bold;">try</span> <span style="color: #bc6ec5;">{</span>
    s=lexical_cast<span style="color: #2d9574;">&lt;</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #2d9574;">&gt;(</span><span style="color: #2d9574;">"56.78"</span><span style="color: #2d9574;">)</span>;  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">bad_lexical_cast</span>
  <span style="color: #bc6ec5;">}</span> <span style="color: #4f97d7; font-weight: bold;">catch</span> <span style="color: #bc6ec5;">(</span>bad_lexical_cast &amp;e<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    cout&lt;&lt;<span style="color: #2d9574;">"Exception caught: "</span>&lt;&lt;e.what<span style="color: #2d9574;">()</span>&lt;&lt;endl;
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #4f97d7; font-weight: bold;">try</span><span style="color: #bc6ec5;">{</span>
  s=lexical_cast<span style="color: #2d9574;">&lt;</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #2d9574;">&gt;(</span><span style="color: #2d9574;">"3456yu"</span><span style="color: #2d9574;">)</span>;<span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">bad_lexical_cast</span>
  <span style="color: #bc6ec5;">}</span><span style="color: #4f97d7; font-weight: bold;">catch</span><span style="color: #bc6ec5;">(</span>bad_lexical_cast &amp;e<span style="color: #bc6ec5;">){</span>
    cout&lt;&lt;<span style="color: #2d9574;">"Exception caught: "</span>&lt;&lt;e.what<span style="color: #2d9574;">()</span>&lt;&lt;endl;
  <span style="color: #bc6ec5;">}</span>
  s=lexical_cast<span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #bc6ec5;">&gt;(</span><span style="color: #2d9574;">"3456yu"</span>,<span style="color: #a45bad;">4</span><span style="color: #bc6ec5;">)</span>;
  cout&lt;&lt;s&lt;&lt;endl;
  <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span style="color: #4f97d7;">}</span> 

</pre>
</div>
</div>
</div>
