docs/C_CPP_Manual.html

<div id="outline-container-orgfd76560" class="outline-3">
<h3 id="orgfd76560"><span class="section-number-3">4.3</span> variant</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">vector</span><span style="color: #4f97d7;">&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">iostream</span><span style="color: #4f97d7;">&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">"boost/variant.hpp"</span>
<span style="color: #4f97d7; font-weight: bold;">using</span> <span style="color: #4f97d7; font-weight: bold;">namespace</span> <span style="color: #a45bad;">std</span>;
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span><span style="color: #bc6ec5;">[]</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">{</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">union</span>
  <span style="color: #4f97d7; font-weight: bold;">union</span> <span style="color: #bc6ec5;">{</span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span>; <span style="color: #ce537a; font-weight: bold;">float</span> <span style="color: #7590db;">f</span>;<span style="color: #bc6ec5;">}</span> <span style="color: #7590db;">u</span>;
  u.i=<span style="color: #a45bad;">34</span>;
  u.f=<span style="color: #a45bad;">2.3</span>;

  <span style="color: #a45bad;">boost</span>::<span style="color: #ce537a; font-weight: bold;">variant</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">int</span>,<span style="color: #ce537a; font-weight: bold;">string</span><span style="color: #bc6ec5;">&gt;</span> <span style="color: #7590db;">u1</span>,<span style="color: #7590db;">u2</span>;
  u1=<span style="color: #a45bad;">2</span>;
  u2=<span style="color: #2d9574;">"hello"</span>;
  cout&lt;&lt;u1&lt;&lt;<span style="color: #2d9574;">" "</span>&lt;&lt;u2&lt;&lt;endl;

  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">u1=u1*2 error</span>
  u1=<span style="color: #a45bad;">boost</span>::get<span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #bc6ec5;">&gt;(</span>u1<span style="color: #bc6ec5;">)</span>*<span style="color: #a45bad;">2</span>;

  <span style="color: #4f97d7; font-weight: bold;">try</span><span style="color: #bc6ec5;">{</span>
    <span style="color: #ce537a; font-weight: bold;">string</span> <span style="color: #7590db;">st</span>=<span style="color: #a45bad;">boost</span>::get<span style="color: #2d9574;">&lt;</span><span style="color: #ce537a; font-weight: bold;">string</span><span style="color: #2d9574;">&gt;(</span>u1<span style="color: #2d9574;">)</span>;  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">throw exception of bad_get</span>
  <span style="color: #bc6ec5;">}</span><span style="color: #4f97d7; font-weight: bold;">catch</span><span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">boost</span>::bad_get &amp;e<span style="color: #bc6ec5;">){</span>
    cout&lt;&lt;<span style="color: #2d9574;">"Exception caught: "</span>&lt;&lt;e.what<span style="color: #2d9574;">()</span>&lt;&lt;endl;
  <span style="color: #bc6ec5;">}</span>
  u1=<span style="color: #2d9574;">"good"</span>;  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">u1 become a sting</span>
  u1=<span style="color: #a45bad;">32</span>;      <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">u1 become a int again</span>

  <span style="color: #a45bad;">boost</span>::<span style="color: #ce537a; font-weight: bold;">variant</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">int</span>,<span style="color: #ce537a; font-weight: bold;">string</span><span style="color: #bc6ec5;">&gt;</span> <span style="color: #7590db;">u3</span>;
  cout&lt;&lt;u3&lt;&lt;endl;

  <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">Double</span><span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">boost</span>::<span style="color: #ce537a; font-weight: bold;">variant</span><span style="color: #2d9574;">&lt;</span><span style="color: #ce537a; font-weight: bold;">int</span>,<span style="color: #ce537a; font-weight: bold;">string</span><span style="color: #2d9574;">&gt;</span> <span style="color: #7590db;">v</span><span style="color: #bc6ec5;">)</span>;

  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">using visitor</span>
  <span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">DoubleVisitor</span>: <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #a45bad;">boost</span>::<span style="color: #ce537a; font-weight: bold;">static_visitor</span><span style="color: #bc6ec5;">&lt;&gt;{</span>
   <span style="color: #4f97d7; font-weight: bold;">public</span>:
    <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #4f97d7; font-weight: bold;">operator</span><span style="color: #2d9574; font-weight: bold;">()</span> <span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">int</span>&amp; <span style="color: #7590db;">i</span><span style="color: #2d9574;">)</span> <span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #2d9574;">{</span>
      i+=i;
    <span style="color: #2d9574;">}</span>
    <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #4f97d7; font-weight: bold;">operator</span><span style="color: #2d9574; font-weight: bold;">()</span> <span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">string</span>&amp; <span style="color: #7590db;">str</span><span style="color: #2d9574;">)</span> <span style="color: #4f97d7; font-weight: bold;">const</span><span style="color: #2d9574;">{</span>
      str+=str;
    <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">}</span>;

  u1=<span style="color: #a45bad;">2</span>;
  <span style="color: #a45bad;">boost</span>::apply_visitor<span style="color: #bc6ec5;">(</span>DoubleVisitor<span style="color: #2d9574;">()</span>,u1<span style="color: #bc6ec5;">)</span>;  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">u1 become 4</span>
  u2=<span style="color: #2d9574;">"hello"</span>;
  <span style="color: #a45bad;">boost</span>::apply_visitor<span style="color: #bc6ec5;">(</span>DoubleVisitor<span style="color: #2d9574;">()</span>,u2<span style="color: #bc6ec5;">)</span>;  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">u2 become "hellohello"</span>

  <span style="color: #a45bad;">std</span>::<span style="color: #ce537a; font-weight: bold;">vector</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #a45bad;">boost</span>::<span style="color: #ce537a; font-weight: bold;">variant</span><span style="color: #2d9574;">&lt;</span><span style="color: #ce537a; font-weight: bold;">int</span>,<span style="color: #ce537a; font-weight: bold;">string</span><span style="color: #2d9574;">&gt;</span><span style="color: #bc6ec5;">&gt;</span> <span style="color: #7590db;">vec</span>;
  vec.push_back<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"good"</span><span style="color: #bc6ec5;">)</span>;
  vec.push_back<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">23</span><span style="color: #bc6ec5;">)</span>;
  vec.push_back<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"bad"</span><span style="color: #bc6ec5;">)</span>;

  <span style="color: #ce537a; font-weight: bold;">DoubleVisitor</span> <span style="color: #7590db;">f</span>;
  <span style="color: #4f97d7; font-weight: bold;">for</span><span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">auto</span> <span style="color: #7590db;">x</span>: vec<span style="color: #bc6ec5;">){</span>
    <span style="color: #a45bad;">boost</span>::apply_visitor<span style="color: #2d9574;">(</span>f,x<span style="color: #2d9574;">)</span>;
    cout&lt;&lt;x&lt;&lt;endl;
  <span style="color: #bc6ec5;">}</span>

  <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
