docs/C_CPP_Manual.org
** Any
#+BEGIN_SRC C++ :exports_both
#include <vector>
#include <iostream>
#include "boost/any.hpp"
using namespace std;
int main(int argc, char *argv[])
{
  boost::any x,y,z;
  x=string("hello");
  x=2.3;
  y='z';
  z=vector<int>();

  cout<<boost::any_cast<char>(y)<<endl;  // return a copy of y's data: 'z'
  cout<<boost::any_cast<double>(x)<<endl; // return a copy of x's data: 2.3
  try {
    cout<<boost::any_cast<int>(x)<<endl;  // throws bad_cast_any
  } catch (boost::bad_any_cast& e) {
    cout<<"Exception: "<<e.what()<<endl;
  }
  try {
    cout<<boost::any_cast<float>(x)<<endl;  // throws bad_any_cast  
  } catch (boost::bad_any_cast& e) {
    cout<<"Exception: "<<e.what()<<endl;
  }

  if(x.empty())
    cout<<"x is empty"<<endl;

  if(x.type()==typeid(char))
    cout<<"x is char"<<endl;
  
  /*This is the wrong use example
  boost::any_cast<vector<int>>(z).push_back(23);
  int i=boost::any_cast<vector<int>>(z).back();  // crash, becase boost::any_cast<vector<int>>(z) return a copy of variable z
  */
  int i;
  boost::any p=&i;
  int* pInt=boost::any_cast<int*>(p);  // returns a pointer
  
  vector<boost::any> m;
  m.push_back(2);
  m.push_back('a');
  m.push_back(p);
  m.push_back(boost::any());

  struct Property{
    string name;
    boost::any value;
  };
  
  vector<Property> properties;
  
  return 0;
}

#+END_SRC

#+RESULTS:
| z          |                      |        |            |       |                 |
| 2.3        |                      |        |            |       |                 |
| Exception: | boost::bad_any_cast: | failed | conversion | using | boost::any_cast |
| Exception: | boost::bad_any_cast: | failed | conversion | using | boost::any_cast |
- This is a common wrong use example
#+BEGIN_SRC C++ :exports_both
  boost::any z;
  z=vector<int>();
  boost::any_cast<vector<int>>(z).push_back(23);
  int i=boost::any_cast<vector<int>>(z).back();  // crash, becase boost::any_cast<vector<int>>(z) return a copy of variable z
#+END_SRC
