docs/C_CPP_Manual.html

<div id="outline-container-org1858c13" class="outline-3">
<h3 id="org1858c13"><span class="section-number-3">4.4</span> Any</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">vector</span><span style="color: #4f97d7;">&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">iostream</span><span style="color: #4f97d7;">&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">"boost/any.hpp"</span>
<span style="color: #4f97d7; font-weight: bold;">using</span> <span style="color: #4f97d7; font-weight: bold;">namespace</span> <span style="color: #a45bad;">std</span>;
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span><span style="color: #bc6ec5;">[]</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">{</span>
  <span style="color: #a45bad;">boost</span>::<span style="color: #ce537a; font-weight: bold;">any</span> <span style="color: #7590db;">x</span>,<span style="color: #7590db;">y</span>,<span style="color: #7590db;">z</span>;
  x=string<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"hello"</span><span style="color: #bc6ec5;">)</span>;
  x=<span style="color: #a45bad;">2.3</span>;
  y=<span style="color: #2d9574;">'z'</span>;
  z=vector<span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #bc6ec5;">&gt;()</span>;

  cout&lt;&lt;<span style="color: #a45bad;">boost</span>::any_cast<span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">char</span><span style="color: #bc6ec5;">&gt;(</span>y<span style="color: #bc6ec5;">)</span>&lt;&lt;endl;  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">return a copy of y's data: 'z'</span>
  cout&lt;&lt;<span style="color: #a45bad;">boost</span>::any_cast<span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">double</span><span style="color: #bc6ec5;">&gt;(</span>x<span style="color: #bc6ec5;">)</span>&lt;&lt;endl; <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">return a copy of x's data: 2.3</span>
  <span style="color: #4f97d7; font-weight: bold;">try</span> <span style="color: #bc6ec5;">{</span>
    cout&lt;&lt;<span style="color: #a45bad;">boost</span>::any_cast<span style="color: #2d9574;">&lt;</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #2d9574;">&gt;(</span>x<span style="color: #2d9574;">)</span>&lt;&lt;endl;  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">throws bad_cast_any</span>
  <span style="color: #bc6ec5;">}</span> <span style="color: #4f97d7; font-weight: bold;">catch</span> <span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">boost</span>::bad_any_cast&amp; e<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    cout&lt;&lt;<span style="color: #2d9574;">"Exception: "</span>&lt;&lt;e.what<span style="color: #2d9574;">()</span>&lt;&lt;endl;
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #4f97d7; font-weight: bold;">try</span> <span style="color: #bc6ec5;">{</span>
    cout&lt;&lt;<span style="color: #a45bad;">boost</span>::any_cast<span style="color: #2d9574;">&lt;</span><span style="color: #ce537a; font-weight: bold;">float</span><span style="color: #2d9574;">&gt;(</span>x<span style="color: #2d9574;">)</span>&lt;&lt;endl;  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">throws bad_any_cast  </span>
  <span style="color: #bc6ec5;">}</span> <span style="color: #4f97d7; font-weight: bold;">catch</span> <span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">boost</span>::bad_any_cast&amp; e<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    cout&lt;&lt;<span style="color: #2d9574;">"Exception: "</span>&lt;&lt;e.what<span style="color: #2d9574;">()</span>&lt;&lt;endl;
  <span style="color: #bc6ec5;">}</span>

  <span style="color: #4f97d7; font-weight: bold;">if</span><span style="color: #bc6ec5;">(</span>x.empty<span style="color: #2d9574;">()</span><span style="color: #bc6ec5;">)</span>
    cout&lt;&lt;<span style="color: #2d9574;">"x is empty"</span>&lt;&lt;endl;

  <span style="color: #4f97d7; font-weight: bold;">if</span><span style="color: #bc6ec5;">(</span>x.type<span style="color: #2d9574;">()</span>==<span style="color: #4f97d7; font-weight: bold;">typeid</span><span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">char</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
    cout&lt;&lt;<span style="color: #2d9574;">"x is char"</span>&lt;&lt;endl;

  <span style="color: #2aa1ae; background-color: #292e34;">/*</span><span style="color: #2aa1ae; background-color: #292e34;">This is the wrong use example</span>
<span style="color: #2aa1ae; background-color: #292e34;">  boost::any_cast&lt;vector&lt;int&gt;&gt;(z).push_back(23);</span>
<span style="color: #2aa1ae; background-color: #292e34;">  int i=boost::any_cast&lt;vector&lt;int&gt;&gt;(z).back();  // crash, becase boost::any_cast&lt;vector&lt;int&gt;&gt;(z) return a copy of variable z</span>
<span style="color: #2aa1ae; background-color: #292e34;">  */</span>
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span>;
  <span style="color: #a45bad;">boost</span>::<span style="color: #ce537a; font-weight: bold;">any</span> <span style="color: #7590db;">p</span>=&amp;i;
  <span style="color: #ce537a; font-weight: bold;">int</span>* <span style="color: #7590db;">pInt</span>=<span style="color: #a45bad;">boost</span>::any_cast<span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">int</span>*<span style="color: #bc6ec5;">&gt;(</span>p<span style="color: #bc6ec5;">)</span>;  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">returns a pointer</span>

  <span style="color: #ce537a; font-weight: bold;">vector</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #a45bad;">boost</span>::<span style="color: #ce537a; font-weight: bold;">any</span><span style="color: #bc6ec5;">&gt;</span> <span style="color: #7590db;">m</span>;
  m.push_back<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">)</span>;
  m.push_back<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">'a'</span><span style="color: #bc6ec5;">)</span>;
  m.push_back<span style="color: #bc6ec5;">(</span>p<span style="color: #bc6ec5;">)</span>;
  m.push_back<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">boost</span>::<span style="color: #bc6ec5; font-weight: bold;">any</span><span style="color: #2d9574;">()</span><span style="color: #bc6ec5;">)</span>;

  <span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #ce537a; font-weight: bold;">Property</span><span style="color: #bc6ec5;">{</span>
    <span style="color: #ce537a; font-weight: bold;">string</span> <span style="color: #7590db;">name</span>;
    <span style="color: #a45bad;">boost</span>::<span style="color: #ce537a; font-weight: bold;">any</span> <span style="color: #7590db;">value</span>;
  <span style="color: #bc6ec5;">}</span>;

  <span style="color: #ce537a; font-weight: bold;">vector</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">Property</span><span style="color: #bc6ec5;">&gt;</span> <span style="color: #7590db;">properties</span>;

  <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span style="color: #4f97d7;">}</span>

</pre>
</div>
<ul class="org-ul">
<li>This is a common wrong use example</li>
</ul>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #a45bad;">boost</span>::<span style="color: #ce537a; font-weight: bold;">any</span> <span style="color: #7590db;">z</span>;
z=vector<span style="color: #4f97d7;">&lt;</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #4f97d7;">&gt;()</span>;
<span style="color: #a45bad;">boost</span>::any_cast<span style="color: #4f97d7;">&lt;</span><span style="color: #ce537a; font-weight: bold;">vector</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #bc6ec5;">&gt;</span><span style="color: #4f97d7;">&gt;(</span>z<span style="color: #4f97d7;">)</span>.push_back<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">23</span><span style="color: #4f97d7;">)</span>;
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span>=<span style="color: #a45bad;">boost</span>::any_cast<span style="color: #4f97d7;">&lt;</span><span style="color: #ce537a; font-weight: bold;">vector</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #bc6ec5;">&gt;</span><span style="color: #4f97d7;">&gt;(</span>z<span style="color: #4f97d7;">)</span>.back<span style="color: #4f97d7;">()</span>;  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">crash, becase boost::any_cast&lt;vector&lt;int&gt;&gt;(z) return a copy of variable z</span>
</pre>
</div>
</div>
</div>
