docs/C_CPP_Manual.org
** optional
#+BEGIN_SRC C++ :exports_both
#include "boost/optional.hpp"
#include "boost/variant.hpp"
#include <iostream>
#include <vector>
#include <deque>
using namespace std;

deque<char> queue;

boost::optional<char>  get_async_data(){
  if(!queue.empty())
    return boost::optional<char>(queue.back());
  else
    return boost::optional<char>();
}

int main(int argc, char *argv[])
{
  boost::variant<nullptr_t,char> v;
  boost::optional<char> op;  // op is uninitalized, no char is constructed
  op='A';                    // op contains 'A'

  op=get_async_data();
  if(!op)
    cout<<"No data is available"<<endl;
  else
  {
    cout<<"op contains: "<<op.get()<<endl;  // get() will crash if op is uninitialized
    cout<<"op contains: "<<*op<<endl;       // crash if op is uninitialized
  }

  op.reset();  // reset op uninitialized state
  cout<<op.get_value_or('z')<<endl;  // return 'z' if op is empty

  char* p =op.get_ptr();  // return null if op is empty

  //optional can store any kind of data
  struct A{string name; int value;};
  A a;
  cout<<"a's name: "<<a.name<<"a's value: "<<a.value<<endl;

  boost::optional<A> opA0;  // constructor of A is not called
  boost::optional<A> opA(a);  // a is copy constructed into opA
  cout<<opA->name<<" "<<opA->value<<endl;

  //Pointer
  boost::optional<A*> opAP(&a);
  (*opAP)->name="Bob";

  //Reference
  boost::optional<A&> opAR(a);
  opAR->name="Bob";  // this changes a.name

  //Relational Operator
  boost::optional<int> i1(1);
  boost::optional<int> i2(9);
  boost::optional<int> i3;
  if(i1<i2)
    cout<<"i2 is bigger"<<endl;  // if both are initialized, *i1<*i2, i3 is uninitialized which is samll than the initialized value
    
  return 0;
}

#+END_SRC

#+RESULTS:
| No  | data  | is     | available |   |
| z   |       |        |           |   |
| a's | name: | a's    | value:    | 1 |
| 1   |       |        |           |   |
| i2  | is    | bigger |           |   |

