docs/C_CPP_Manual.html
<div id="outline-container-orgaf890ec" class="outline-3">
<h3 id="orgaf890ec"><span class="section-number-3">4.5</span> optional</h3>
<div class="outline-text-3" id="text-4-5">
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">"boost/optional.hpp"</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">"boost/variant.hpp"</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">iostream</span><span style="color: #4f97d7;">&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">vector</span><span style="color: #4f97d7;">&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">deque</span><span style="color: #4f97d7;">&gt;</span>
<span style="color: #4f97d7; font-weight: bold;">using</span> <span style="color: #4f97d7; font-weight: bold;">namespace</span> <span style="color: #a45bad;">std</span>;

<span style="color: #ce537a; font-weight: bold;">deque</span><span style="color: #4f97d7;">&lt;</span><span style="color: #ce537a; font-weight: bold;">char</span><span style="color: #4f97d7;">&gt;</span> <span style="color: #7590db;">queue</span>;

<span style="color: #a45bad;">boost</span>::<span style="color: #ce537a; font-weight: bold;">optional</span><span style="color: #4f97d7;">&lt;</span><span style="color: #ce537a; font-weight: bold;">char</span><span style="color: #4f97d7;">&gt;</span>  <span style="color: #bc6ec5; font-weight: bold;">get_async_data</span><span style="color: #4f97d7;">(){</span>
  <span style="color: #4f97d7; font-weight: bold;">if</span><span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">!</span>queue.empty<span style="color: #2d9574;">()</span><span style="color: #bc6ec5;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">boost</span>::optional<span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">char</span><span style="color: #bc6ec5;">&gt;(</span>queue.back<span style="color: #2d9574;">()</span><span style="color: #bc6ec5;">)</span>;
  <span style="color: #4f97d7; font-weight: bold;">else</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">boost</span>::optional<span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">char</span><span style="color: #bc6ec5;">&gt;()</span>;
<span style="color: #4f97d7;">}</span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">argv</span><span style="color: #bc6ec5;">[]</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">{</span>
  <span style="color: #a45bad;">boost</span>::<span style="color: #ce537a; font-weight: bold;">variant</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">nullptr_t</span>,<span style="color: #ce537a; font-weight: bold;">char</span><span style="color: #bc6ec5;">&gt;</span> <span style="color: #7590db;">v</span>;
  <span style="color: #a45bad;">boost</span>::<span style="color: #ce537a; font-weight: bold;">optional</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">char</span><span style="color: #bc6ec5;">&gt;</span> <span style="color: #7590db;">op</span>;  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">op is uninitalized, no char is constructed</span>
  op=<span style="color: #2d9574;">'A'</span>;                    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">op contains 'A'</span>

  op=get_async_data<span style="color: #bc6ec5;">()</span>;
  <span style="color: #4f97d7; font-weight: bold;">if</span><span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">!</span>op<span style="color: #bc6ec5;">)</span>
    cout&lt;&lt;<span style="color: #2d9574;">"No data is available"</span>&lt;&lt;endl;
  <span style="color: #4f97d7; font-weight: bold;">else</span>
  <span style="color: #bc6ec5;">{</span>
    cout&lt;&lt;<span style="color: #2d9574;">"op contains: "</span>&lt;&lt;op.get<span style="color: #2d9574;">()</span>&lt;&lt;endl;  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">get() will crash if op is uninitialized</span>
    cout&lt;&lt;<span style="color: #2d9574;">"op contains: "</span>&lt;&lt;*op&lt;&lt;endl;       <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">crash if op is uninitialized</span>
  <span style="color: #bc6ec5;">}</span>

  op.reset<span style="color: #bc6ec5;">()</span>;  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">reset op uninitialized state</span>
  cout&lt;&lt;op.get_value_or<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">'z'</span><span style="color: #bc6ec5;">)</span>&lt;&lt;endl;  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">return 'z' if op is empty</span>

  <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">p</span> =op.get_ptr<span style="color: #bc6ec5;">()</span>;  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">return null if op is empty</span>

  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">optional can store any kind of data</span>
  <span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #ce537a; font-weight: bold;">A</span><span style="color: #bc6ec5;">{</span><span style="color: #ce537a; font-weight: bold;">string</span> <span style="color: #7590db;">name</span>; <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">value</span>;<span style="color: #bc6ec5;">}</span>;
  <span style="color: #ce537a; font-weight: bold;">A</span> <span style="color: #7590db;">a</span>;
  cout&lt;&lt;<span style="color: #2d9574;">"a's name: "</span>&lt;&lt;a.name&lt;&lt;<span style="color: #2d9574;">"a's value: "</span>&lt;&lt;a.value&lt;&lt;endl;

  <span style="color: #a45bad;">boost</span>::<span style="color: #ce537a; font-weight: bold;">optional</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">A</span><span style="color: #bc6ec5;">&gt;</span> <span style="color: #7590db;">opA0</span>;  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">constructor of A is not called</span>
  <span style="color: #a45bad;">boost</span>::<span style="color: #ce537a; font-weight: bold;">optional</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">A</span><span style="color: #bc6ec5;">&gt;</span> <span style="color: #bc6ec5; font-weight: bold;">opA</span><span style="color: #bc6ec5;">(</span>a<span style="color: #bc6ec5;">)</span>;  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">a is copy constructed into opA</span>
  cout&lt;&lt;opA-&gt;name&lt;&lt;<span style="color: #2d9574;">" "</span>&lt;&lt;opA-&gt;value&lt;&lt;endl;

  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">Pointer</span>
  <span style="color: #a45bad;">boost</span>::<span style="color: #ce537a; font-weight: bold;">optional</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">A</span>*<span style="color: #bc6ec5;">&gt;</span> <span style="color: #7590db;">opAP</span><span style="color: #bc6ec5;">(</span>&amp;a<span style="color: #bc6ec5;">)</span>;
  <span style="color: #bc6ec5;">(</span>*opAP<span style="color: #bc6ec5;">)</span>-&gt;name=<span style="color: #2d9574;">"Bob"</span>;

  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">Reference</span>
  <span style="color: #a45bad;">boost</span>::<span style="color: #ce537a; font-weight: bold;">optional</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">A</span>&amp;<span style="color: #bc6ec5;">&gt;</span> <span style="color: #bc6ec5; font-weight: bold;">opAR</span><span style="color: #bc6ec5;">(</span>a<span style="color: #bc6ec5;">)</span>;
  opAR-&gt;name=<span style="color: #2d9574;">"Bob"</span>;  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">this changes a.name</span>

  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">Relational Operator</span>
  <span style="color: #a45bad;">boost</span>::<span style="color: #ce537a; font-weight: bold;">optional</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #bc6ec5;">&gt;</span> <span style="color: #7590db;">i1</span><span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span>;
  <span style="color: #a45bad;">boost</span>::<span style="color: #ce537a; font-weight: bold;">optional</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #bc6ec5;">&gt;</span> <span style="color: #7590db;">i2</span><span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">9</span><span style="color: #bc6ec5;">)</span>;
  <span style="color: #a45bad;">boost</span>::<span style="color: #ce537a; font-weight: bold;">optional</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #bc6ec5;">&gt;</span> <span style="color: #7590db;">i3</span>;
  <span style="color: #4f97d7; font-weight: bold;">if</span><span style="color: #bc6ec5;">(</span>i1&lt;i2<span style="color: #bc6ec5;">)</span>
    cout&lt;&lt;<span style="color: #2d9574;">"i2 is bigger"</span>&lt;&lt;endl;  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">if both are initialized, *i1&lt;*i2, i3 is uninitialized which is samll than the initialized value</span>

  <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span style="color: #4f97d7;">}</span>

</pre>
</div>
</div>
</div>
</div>
