docs/C_CPP_Manual.org
* Code optimization
* Hack Technology
** DLL injection
#+BEGIN_SRC C : tangle:main.c
  #include<stdio.h>
  #include<stdlib.h>
  int num=100;
  void add(int a)
  {
    num +=a; //charge money or add blood
  }
  void msg()
  {
    printf("num = %d",num);
  }
  int main()
  {
    printf("add=%p, msg=%p\n",add,msg);
    while(1)
      {
        printf("%d\n",num);
        sleep(5000);
      }

  }
#+END_SRC

#+RESULTS:
| add=0x55620798e6a0, | msg=0x55620798e6bb |
|                 100 |                    |
...
Create a "dll" to inject to main program.
#+BEGIN_SRC C :injector.dll
  #inclue<stdio.h>
  #incude<stdlib.h>
  _declspec(dllexport) void hack()
  {
    int (*p)(int)= (int(*)(int))0x55620798e6a0; //the address of "add" function
    p(10);
  }
#+END_SRC

* reference
1. [[http://boqian.weebly.com/][boqian's space]]
